Ran Plan for 5 projects:

1. project: `marketplace-ecs-web-api-prod` dir: `terraform/environments/prod/ecs-web-api` workspace: `default`
1. project: `marketplace-ecs-worker-prod` dir: `terraform/environments/prod/ecs-worker` workspace: `default`
1. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
1. project: `marketplace-ecs-scheduler-stage` dir: `terraform/environments/stage/ecs-scheduler` workspace: `default`
1. project: `marketplace-ecs-worker-stage` dir: `terraform/environments/stage/ecs-worker` workspace: `default`
---

### 1. project: `marketplace-ecs-web-api-prod` dir: `terraform/environments/prod/ecs-web-api` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/47/default/terraform/environments/prod/ecs-web-api/marketplace-ecs-web-api-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/47/default/terraform/environments/prod/ecs-web-api": exit status 1
data.aws_ssm_parameter.sentry_dsn: Reading...
data.aws_ssm_parameter.authhub_service_token: Reading...
module.ecs_service.data.aws_region.current: Reading...
data.aws_ecs_cluster.main: Reading...
module.web_api_task_execution_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.ses_secret_access_key: Reading...
module.web_api_task_role.aws_iam_role.this: Refreshing state... [id=marketplace-web-api-task-role-prod]
data.aws_ssm_parameter.ses_access_key_id: Reading...
data.aws_ssm_parameter.naver_commerce_client_secret: Reading...
module.ecs_service.data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.private_subnets: Reading...
module.web_api_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.legacy_db_password: Reading...
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.rds_proxy_endpoint: Reading...
data.aws_ssm_parameter.rds_proxy_endpoint: Read complete after 0s [id=/shared/rds/proxy-endpoint]
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
module.web_api_task_role.data.aws_caller_identity.current: Reading...
data.aws_ecr_repository.web_api: Reading...
module.web_api_task_role.data.aws_region.current: Reading...
module.web_api_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.web_api_task_execution_role.data.aws_region.current: Reading...
data.aws_ecs_cluster.main: Read complete after 0s [id=arn:aws:ecs:ap-northeast-2:646886795421:cluster/marketplace-cluster-prod]
module.web_api_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.service_discovery_namespace_id: Reading...
data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.ses_secret_access_key: Read complete after 0s [id=/marketplace/ses/secret-access-key]
data.aws_ssm_parameter.authhub_service_token: Read complete after 0s [id=/authhub/security/service-token-secret]
data.aws_ssm_parameter.ses_access_key_id: Read complete after 0s [id=/marketplace/ses/access-key-id]
data.aws_ssm_parameter.amp_workspace_arn: Reading...
data.aws_ssm_parameter.legacy_db_password: Read complete after 0s [id=/marketplace/prod/legacy-db-password]
data.aws_ssm_parameter.vpc_id: Reading...
module.web_api_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.amp_remote_write_url: Reading...
data.aws_ssm_parameter.naver_commerce_client_id: Reading...
data.aws_ssm_parameter.service_token_secret: Reading...
module.web_api_task_execution_role.aws_iam_role.this: Refreshing state... [id=marketplace-web-api-execution-role-prod]
data.aws_ssm_parameter.sentry_dsn: Read complete after 0s [id=/marketplace/sentry/dsn]
data.aws_ssm_parameter.fileflow_service_token: Reading...
data.aws_ssm_parameter.service_discovery_namespace_id: Read complete after 0s [id=/shared/service-discovery/namespace-id]
data.aws_secretsmanager_secret.rds: Reading...
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
data.aws_ssm_parameter.amp_remote_write_url: Read complete after 0s [id=/shared/monitoring/amp-remote-write-url]
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
aws_kms_key.logs: Refreshing state... [id=93ea61c9-28cc-45e6-916d-10820e71083b]
data.aws_vpc.main: Reading...
module.ecs_service.aws_service_discovery_service.this[0]: Refreshing state... [id=srv-ugq6klxq5bnypco2]
module.ecs_security_group.aws_security_group.this: Refreshing state... [id=sg-0bdc1f8ede980396b]
data.aws_ssm_parameter.fileflow_service_token: Read complete after 0s [id=/shared/security/service-token-secret]
data.aws_ssm_parameter.service_token_secret: Read complete after 0s [id=/shared/security/service-token-secret]
data.aws_secretsmanager_secret.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:marketplace/rds/credentials-MGeUIP]
data.aws_secretsmanager_secret_version.rds: Reading...
data.aws_secretsmanager_secret_version.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:marketplace/rds/credentials-MGeUIP|AWSCURRENT]
aws_kms_alias.logs: Refreshing state... [id=alias/marketplace-web-api-logs-prod]
module.web_api_logs.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/ecs/marketplace-web-api-prod/application]
module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-00fd6b2f6352abe81]
data.aws_ecr_repository.web_api: Read complete after 0s [id=marketplace-web-api-prod]
data.aws_vpc.main: Read complete after 0s
module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"]: Refreshing state... [id=sgr-073dd280795b09cff]
module.web_api_task_execution_role.aws_iam_role_policy.secrets-manager[0]: Refreshing state... [id=marketplace-web-api-execution-role-prod:marketplace-web-api-execution-role-prod-secrets-manager]
module.web_api_task_execution_role.aws_iam_role_policy.custom["ssm-access"]: Refreshing state... [id=marketplace-web-api-execution-role-prod:marketplace-web-api-execution-role-prod-ssm-access]
module.web_api_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"]: Refreshing state... [id=marketplace-web-api-execution-role-prod-20260207055031757900000002]
module.web_api_task_role.aws_iam_role_policy.custom["ses-access"]: Refreshing state... [id=marketplace-web-api-task-role-prod:marketplace-web-api-task-role-prod-ses-access]
module.web_api_task_role.aws_iam_role_policy.custom["adot-amp-access"]: Refreshing state... [id=marketplace-web-api-task-role-prod:marketplace-web-api-task-role-prod-adot-amp-access]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.web_api_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be updated in-place
  ~ resource "aws_iam_role_policy" "custom" {
        id          = "marketplace-web-api-execution-role-prod:marketplace-web-api-execution-role-prod-ssm-access"
        name        = "marketplace-web-api-execution-role-prod-ssm-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:ssm:ap-northeast-2:*:parameter/authhub/*",
                          + "arn:aws:ssm:ap-northeast-2:*:parameter/naver-commerce/*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:ap-northeast-2:646886795421:key/93ea61c9-28cc-45e6-916d-10820e71083b",
                            "arn:aws:kms:ap-northeast-2:646886795421:key/f3020de8-a983-4918-8223-6a0fbda5f4f6",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
╷
│ Error: reading SSM Parameter (/naver-commerce/prod/client-id): couldn't find resource
│ 
│   with data.aws_ssm_parameter.naver_commerce_client_id,
│   on provider.tf line 153, in data "aws_ssm_parameter" "naver_commerce_client_id":
│  153: data "aws_ssm_parameter" "naver_commerce_client_id" {
│ 
╵
╷
│ Error: reading SSM Parameter (/naver-commerce/prod/client-secret): couldn't find resource
│ 
│   with data.aws_ssm_parameter.naver_commerce_client_secret,
│   on provider.tf line 157, in data "aws_ssm_parameter" "naver_commerce_client_secret":
│  157: data "aws_ssm_parameter" "naver_commerce_client_secret" {
│ 
╵


```
</details>

---
### 2. project: `marketplace-ecs-worker-prod` dir: `terraform/environments/prod/ecs-worker` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/47/default/terraform/environments/prod/ecs-worker/marketplace-ecs-worker-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/47/default/terraform/environments/prod/ecs-worker": exit status 1
data.aws_ssm_parameter.sentry_dsn: Reading...
data.aws_ssm_parameter.naver_commerce_client_id: Reading...
data.aws_ssm_parameter.sqs_intelligence_aggregation_queue_url: Reading...
data.aws_ssm_parameter.sqs_outbound_sync_queue_url: Reading...
data.aws_ssm_parameter.sqs_intelligence_notice_analysis_queue_url: Reading...
data.aws_ssm_parameter.naver_commerce_client_secret: Reading...
data.aws_secretsmanager_secret.rds: Reading...
data.aws_ssm_parameter.sqs_verification_queue_url: Reading...
data.aws_ssm_parameter.fileflow_service_token: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.sqs_access_policy_arn: Reading...
data.aws_ssm_parameter.authhub_service_token: Reading...
data.aws_ssm_parameter.sqs_outbound_sync_queue_url: Read complete after 0s [id=/marketplace/sqs/outbound-sync-queue-url]
data.aws_ssm_parameter.sqs_intelligence_notice_analysis_queue_url: Read complete after 0s [id=/marketplace/sqs/intelligence-notice-analysis-queue-url]
data.aws_ssm_parameter.sqs_intelligence_aggregation_queue_url: Read complete after 0s [id=/marketplace/sqs/intelligence-aggregation-queue-url]
data.aws_ssm_parameter.sqs_verification_queue_url: Read complete after 0s [id=/marketplace/sqs/inspection-verification-queue-url]
data.aws_ssm_parameter.rds_proxy_endpoint: Reading...
data.aws_ecs_cluster.main: Reading...
data.aws_ssm_parameter.sqs_intelligence_orchestration_queue_url: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Reading...
module.worker_task_execution_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.fileflow_service_token: Read complete after 0s [id=/shared/security/service-token-secret]
data.aws_ssm_parameter.sqs_access_policy_arn: Read complete after 0s [id=/marketplace/sqs/access-policy-arn]
data.aws_ssm_parameter.sqs_scoring_queue_url: Reading...
data.aws_ssm_parameter.sentry_dsn: Read complete after 0s [id=/marketplace/sentry/dsn]
data.aws_secretsmanager_secret.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:marketplace/rds/credentials-MGeUIP]
module.worker_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.openai_api_key: Reading...
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.sqs_intelligence_option_analysis_queue_url: Reading...
module.worker_task_role.aws_iam_role.this: Refreshing state... [id=marketplace-worker-task-role-prod]
data.aws_ssm_parameter.amp_remote_write_url: Read complete after 0s [id=/shared/monitoring/amp-remote-write-url]
data.aws_ecr_repository.worker: Reading...
data.aws_ssm_parameter.rds_proxy_endpoint: Read complete after 0s [id=/shared/rds/proxy-endpoint]
data.aws_ssm_parameter.authhub_service_token: Read complete after 0s [id=/authhub/security/service-token-secret]
module.ecs_service.data.aws_caller_identity.current: Reading...
module.worker_task_execution_role.data.aws_region.current: Reading...
module.worker_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.ecs_service.data.aws_region.current: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.sqs_intelligence_description_analysis_queue_url: Reading...
data.aws_ssm_parameter.sqs_intelligence_orchestration_queue_url: Read complete after 0s [id=/marketplace/sqs/intelligence-orchestration-queue-url]
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.worker_task_role.data.aws_region.current: Reading...
module.worker_task_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.legacy_db_password: Reading...
module.worker_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.sqs_scoring_queue_url: Read complete after 0s [id=/marketplace/sqs/inspection-scoring-queue-url]
data.aws_ssm_parameter.sqs_enhancement_queue_url: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
module.worker_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.sqs_intelligence_option_analysis_queue_url: Read complete after 0s [id=/marketplace/sqs/intelligence-option-analysis-queue-url]
data.aws_ecs_cluster.main: Read complete after 0s [id=arn:aws:ecs:ap-northeast-2:646886795421:cluster/marketplace-cluster-prod]
data.aws_ssm_parameter.amp_workspace_arn: Reading...
aws_kms_key.logs: Refreshing state... [id=1f0c0d10-1a78-47c8-82c6-436f6a28b901]
module.worker_task_execution_role.aws_iam_role.this: Refreshing state... [id=marketplace-worker-execution-role-prod]
data.aws_ssm_parameter.sqs_intelligence_description_analysis_queue_url: Read complete after 0s [id=/marketplace/sqs/intelligence-description-analysis-queue-url]
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
data.aws_ssm_parameter.openai_api_key: Read complete after 0s [id=/marketplace/openai/api-key]
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
data.aws_secretsmanager_secret_version.rds: Reading...
data.aws_ssm_parameter.sqs_enhancement_queue_url: Read complete after 0s [id=/marketplace/sqs/inspection-enhancement-queue-url]
data.aws_vpc.main: Reading...
module.ecs_security_group.aws_security_group.this: Refreshing state... [id=sg-0c6e20e8635f53cfc]
data.aws_ssm_parameter.legacy_db_password: Read complete after 0s [id=/marketplace/prod/legacy-db-password]
data.aws_secretsmanager_secret_version.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:marketplace/rds/credentials-MGeUIP|AWSCURRENT]
aws_kms_alias.logs: Refreshing state... [id=alias/marketplace-worker-logs-prod]
module.worker_logs.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/ecs/marketplace-worker-prod/application]
module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-0335ce31c62841f10]
data.aws_ecr_repository.worker: Read complete after 0s [id=marketplace-worker-prod]
data.aws_vpc.main: Read complete after 0s
module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"]: Refreshing state... [id=sgr-07c65153a614f27e9]
module.worker_task_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::646886795421:policy/marketplace-sqs-access-prod"]: Refreshing state... [id=marketplace-worker-task-role-prod-20260306122114871900000001]
module.worker_task_role.aws_iam_role_policy.custom["adot-amp-access"]: Refreshing state... [id=marketplace-worker-task-role-prod:marketplace-worker-task-role-prod-adot-amp-access]
module.worker_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"]: Refreshing state... [id=marketplace-worker-execution-role-prod-20260219022926699200000001]
module.worker_task_execution_role.aws_iam_role_policy.secrets-manager[0]: Refreshing state... [id=marketplace-worker-execution-role-prod:marketplace-worker-execution-role-prod-secrets-manager]
module.worker_task_execution_role.aws_iam_role_policy.custom["ssm-access"]: Refreshing state... [id=marketplace-worker-execution-role-prod:marketplace-worker-execution-role-prod-ssm-access]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: reading SSM Parameter (/naver-commerce/prod/client-id): couldn't find resource
│ 
│   with data.aws_ssm_parameter.naver_commerce_client_id,
│   on provider.tf line 204, in data "aws_ssm_parameter" "naver_commerce_client_id":
│  204: data "aws_ssm_parameter" "naver_commerce_client_id" {
│ 
╵
╷
│ Error: reading SSM Parameter (/naver-commerce/prod/client-secret): couldn't find resource
│ 
│   with data.aws_ssm_parameter.naver_commerce_client_secret,
│   on provider.tf line 208, in data "aws_ssm_parameter" "naver_commerce_client_secret":
│  208: data "aws_ssm_parameter" "naver_commerce_client_secret" {
│ 
╵


```
</details>

---
### 3. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-stage/marketplace-api-stage"
        name                               = "marketplace-api-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-api-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-api-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-web-api"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage:256" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage:256" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-api-stage" -> (known after apply)
      ~ revision                 = 256 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-api-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-api-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-web-api"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn   = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage:256" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-web-api-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-web-api-stage
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
### 4. project: `marketplace-ecs-scheduler-stage` dir: `terraform/environments/stage/ecs-scheduler` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-stage/marketplace-scheduler-stage"
        name                               = "marketplace-scheduler-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-scheduler-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-scheduler-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-scheduler"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage:261" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage:261" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-scheduler-stage" -> (known after apply)
      ~ revision                 = 261 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-scheduler-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-scheduler-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-scheduler"
        }
        # (12 unchanged attributes hidden)
    }

  # module.scheduler_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be updated in-place
~ resource "aws_iam_role_policy" "custom" {
        id          = "marketplace-scheduler-execution-role-stage:marketplace-scheduler-execution-role-stage-ssm-access"
        name        = "marketplace-scheduler-execution-role-stage-ssm-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:ssm:ap-northeast-2:*:parameter/authhub/*",
                          + "arn:aws:ssm:ap-northeast-2:*:parameter/naver-commerce/*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:ap-northeast-2:646886795421:key/667039cf-f3ee-4c0f-8cd1-cc40f325cff8",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn   = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage:261" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-scheduler-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-scheduler%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-scheduler-stage
  ```
Plan: 1 to add, 2 to change, 1 to destroy.

---
### 5. project: `marketplace-ecs-worker-stage` dir: `terraform/environments/stage/ecs-worker` workspace: `default`
**Plan Error**
```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/47/default/terraform/environments/stage/ecs-worker/marketplace-ecs-worker-stage-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/47/default/terraform/environments/stage/ecs-worker": exit status 1
╷
│ Error: Required plugins are not installed
│ 
│ The installed provider plugins are not consistent with the packages
│ selected in the dependency lock file:
│   - registry.terraform.io/hashicorp/aws: the cached package for registry.terraform.io/hashicorp/aws 5.100.0 (in .terraform/providers) does not match any of the checksums recorded in the dependency lock file
│ 
│ Terraform uses external plugins to integrate with a variety of different
│ infrastructure services. You must install the required plugins before
│ running Terraform operations.
╵

```

---
### Plan Summary

5 projects, 2 with changes, 0 with no changes, 3 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```